#+TITLE: Active documents with org-mode
   :PROPERTIES:
   :ID:       720b4401-438c-46d0-97a1-d2dcda562951
   :Attachments: Article-Active-Documents.pdf
   :END:
   - Remarquons que la mise en page du document s'écarte (significativement) de la mise en page classique du document exporté : le processus de publication permet donc d'introduire une mise en page adaptée à un gabaris standard (celui du journal où l'aricle est publié).  Les indications sémantiques (le bloc ''comment'', le titre, les auteurs, le résumé (''abstract'') par exemple) servent probablement de guide.  Le travail de remise en page est probablement complexe, et demande des connaissances spécifiques.
   - L'article est centré sur la notion de recherche reproductible, mais le lien avec les documents actifs est fort (la découverte de la notion de RR est même à la base de celle de mon idée initiale sur les documents actifs).
   - Le document utilise la version 7.5 de /ORG/, certaines commandes utilisées sont obsolètes (par exemple =#+source:= à la place =/#+name:=).

*** Exemples simples de blocs de données et de code
Il est possible de définir des bloc de plusieurs type :
- Ici un bloc de donnée contenant du texte :
  #+begin_example 
  raw textual data
  #+end_example
- Ici un bloc de code (shell)
  #+begin_src sh 
  echo "un message retourné par un script shell"
  #+end_src

  #+RESULTS:
  : un message retourné par un script shell

Pour rendre le document actif, il faut pouvoir avoir accès aux données.  Pour cela, on nomme les blocs (de données ou de texte).
#+caption: données utilisées dans le script suivant.
#+name: donnee-nommee
#+begin_example 
donnees brutes textuelles
#+end_example

Puis on utilise l'en-tête :var NomLocal=NomBlock.
#+name: compte-texte
#+begin_src sh :var texte=donnee-nommee
echo $texte | wc 
#+end_src

#+RESULTS: compte-texte
: 1       3      26

Remarquons qu'il est aussi possible, dans le cas de bloc de données courts, de raccourcir la définition du bloc :
Soit la première valeur
#+name: pi
: 3.141592756
et la seconde
#+name: rayon
: 10
On calcule simplement
#+name: calcule-circonférence
#+begin_src python :var cst_pi=pi :var r=rayon
return 2*cst_pi*r
#+end_src

#+RESULTS: calcule-circonférence
: None

- Les blocs de code peuvent être multilangage.
- Les blocs de code peuvent être chaînés permettant ainsi d'écrire tout un programme en utilisant le langage adéquat au moment voulu.
*** Application
    :PROPERTIES:
    :header-args: :exports none
    :END:
On reprends ici l'exemple donné dans l'article, avec quelques variations pour simplifier.

Nous souhaitons étudier la saison :
#+name: saison-etude
: 2010

On commence par construire le nom du fichier à télécharger.
#+name: fichier-donnees-brut
#+begin_src sh :var saison=saison-etude :exports results
echo "gl$saison.zip"
#+end_src


À partir de cette données, on construit l'URL où l'on va récupérer les donnees
#+name: url
#+begin_src sh :var fichier=fichier-donnees-brut :exports results
echo "http://www.retrosheet.org/gamelogs/$fichier"
#+end_src

#+RESULTS: url
: http://www.retrosheet.org/gamelogs/gl2010.zip

Puis on procède à la récupération effective des données
#+name: recupère-données
#+begin_src sh :cache yes :var url=url :file donnees.csv :exports results
  echo $url
  wget $url && \
  unzip -p gl2010.
 #+end_src

#+RESULTS[abd785a84d117be2cf5e6b73c5f4933e72edeb97]: recupère-données
[[file:donnees.csv]]

#+name: stat-headers
#+headers: :exports none
#+begin_src python :results list list :cache yes :return fields
  import urllib2
  url= 'http://www.retrosheet.org/gamelogs/glfields.txt'
  fp= urllib2.urlopen(url)
  print fp
  fields= []
  for line in fp:
      if line.find('Visiting team offensive statistics') != -1:
         line=fp.readline()
         while line.find('Visiting team pitching statistics') == -1:
               if line[13] != ' ' :
                  fields.append(line.strip().split('.')[0].split("(")[0])
               line= fp.readline()

#+end_src

#+RESULTS[1b7e75375207b90aac4e9a397826b544f2317cd9]: stat-headers
- at-bats
- hits
- doubles
- triples
- homeruns
- RBI
- sacrifice hits
- sacrifice flies 
- hit-by-pitch
- walks
- intentional walks
- strikeouts
- stolen bases
- caught stealing
- grounded into double plays
- awarded first on catcher's interference
- left on base

*Remarque*
- Les fichiers peuvent contenir des accents
- Il serait intéressant d'avoir un procédé pour supprimer les résultats intermédiaires
